#კომენტარი იქმნება დიეზით -> # და ის იგნორდება კომპიუტერის მიერ ამიტომ შეგვიძლია ავხსნათ ჩვენი კოდი
#ქეის სენსიტიურობა არის განსხვავება დიდ და პატარა ასოებს შორის სიტუაციის მიხედვით ორივე შეიძლება გამოვიყენოთ მაგრამ მაინც ჯობია პატარა ასოებით ვიმუშაოდ
#მაგალითად:
credit=700
credit=900
CREDIT=600
print(CREDIT)
#სნეიკ ქეისი არის დეფისის გამოყენება სიტყვების გასაცალკევებლად მაგ:
myfavouritedrink="cola"
#რთულია გადაბმულად კითხვა და ჯობია:
my_favourite_drink="cola"
print(my_favourite_drink)
#ეს უფრო მარტივია წასაკითხად
#დებაგინგი არის ბაგების შესწორება მაგალითად როგორიცაა typo
print("hello world")
city="london"
print(city)