#sequensing-ი არის როდესაც კოდს მაღლიდან დაბლა მიუყვება
#selection-ი არის ერთი რაღაც მითითებულის ორი პასუხიდან ერთერთის ამორჩევა
#iteration-ი არის კოდის რამდენჯერმე გამეორება ეს ერთ ცალზე არ ხდება უნდა იყოს 2ზე მეტი
#ალგორითმი არის რაღაც გამიზნული მოქმედება მაგალითად ჩვენ სკოლაში უნდა წავიდეთ და მივდივართ სკოლაში ახლა (მე ყოველ შემთხვევაში მიწევს)
#ალგორითმს ჩვენ ვხედავთ კოდების სახით ყველა კოდი ალგორითმია რომელსაც თავისი დავალება აქვს
misho=str("misho")
name=str(input("input your name: "))
print(bool(misho==name))
#flowchart-ი გვეხმარება ალგორითმების ნახვაში და ვიზუალიზირებაში
#pseudocode-ი კოდის მსგავსია და ის მუშაობს კოდის ახსნის მსგავსად
#NATURAL LANGUAGE-ი არის ნატურალური ენა რომლითაც შედგება კოდი და კომენტარები და ყველაფერი რაც იწერება